# screen size
WIN_WIDTH = 1024
WIN_HEIGHT = 600
# frame rate
FPS = 60
# color
BLACK = (0, 0, 0)
WHITE = (255, 255, 255)
RED = (255, 0, 0)
GREEN = (0, 255, 0)
PURPLE = (147, 0, 147)
# enemy path
PATH = [(22, 308), (52, 283), (84, 283), (110, 305), (116, 341), (115, 375), (112, 405), (116, 433),
          (135, 455), (159, 475), (188, 480), (217, 481), (243, 474), (267, 463), (291, 454), (315, 441),
          (334, 423), (343, 398), (339, 368), (328, 345), (305, 331), (282, 322), (264, 303), (255, 283),
          (259, 259), (274, 239), (294, 225), (318, 214), (347, 212), (373, 217), (394, 230), (410, 250),
          (429, 266), (446, 282), (465, 295), (483, 310), (502, 321), (523, 309), (535, 282), (535, 254),
          (533, 230), (532, 190)]

#把原本的純字串轉成同上list內是tuple的型態
R_PATH=[]
with open('path_point.txt', 'r') as f:
    R_PATH_str=f.read()
    R_PATH_str=R_PATH_str.strip("[").strip("]").strip("(").strip(")")
    R_PATH=R_PATH_str.split("), (")

    for i in range(0,len(R_PATH)):
        R_PATH[i]=R_PATH[i].split(", ")
        R_PATH[i][0]=int(R_PATH[i][0])
        R_PATH[i][1]=int(R_PATH[i][1])
        R_PATH[i]=tuple(R_PATH[i])
